//
//  ContentModel.swift
//  NawafilApp
//
//  Created by Eatzaz Hafiz on 11/02/2026.
//

import SwiftUI
import Foundation


struct CardData: Identifiable {
    let id = UUID()
    let title: String
    let content: String
}

enum NawafilTopic: String, CaseIterable, Identifiable {
    // MARK: Prayer topics
    case duha = "صلاة الضحى"
    case qiyam = "قيام الليل"
    case sunnahFajr = "سنة الفجر"
    case sunnahDhuhr = "سنة الظهر"
    case sunnahMaghrib = "سنة المغرب"
    case sunnahIsha = "سنة العشاء"
    
    // MARK: Fasting topics
    case mondayThursday = "صيام الاثنين والخميس"
    case whiteDays = "صيام الأيام البيض"
    case arafah = "صيام يوم عرفة"
    case dhuHijahTen = "صيام العشر من ذي الحجة"
    case ashura = "صيام يوم عاشوراء"
    case shawwal = "صيام ستة من شوال"
    
    // MARK: Adkhar topics
    case morningAdhkar = "أذكار الصباح"
    case eveningAdhkar = "أذكار المساء"

    var id: String { rawValue }

    var cards: [CardData] {
        switch self {
            
            // MARK: Prayer topics
        case .duha:
            return [
                CardData(
                    title: "حكمها",
                    content: """
            سنة مؤكدة، أوصى بها النبي ﷺ بعض أصحابه.  
            وفعلها ﷺ في بعض الأحيان، وصلاها يوم الفتح ثمان ركعات
            """
                ),
                CardData(
                    title: "وقتها",
                    content: """
            من ارتفاع الشمس قيد رمح  
            إلى قبيل الظهر
            وأفضلها عند اشتداد الضحى؛  
            «صلاة الأوابين حين ترمض الفصال»
            """
                ),
                CardData(
                    title: "كيفيتها",
                    content: """
            أقلها ركعتان تسليمة واحدة.  
            ويجوز أربعًا، أو ستًا، أو ثمانًا، أو أكثر
            يسلم من كل ركعتين.  
            وقد صلاها ﷺ يوم الفتح ثماني ركعات
            """
                )
            ]

        case .qiyam:
            return [
                CardData(
                    title: "حكمها:",
                    content: """
        قيام الليل مشروع وسنة مؤكدة، ومن أعمال الصالحين، ومن فعل النبي ﷺ.
        """
                ),
                CardData(
                    title: "وقتها:",
                    content: """
        في أول الليل، أو وسطه، أو آخره، وآخره أفضل، والثلث الأخير أفضل، إلا إن شق عليه فيوتر أول الليل.
        """
                ),
                CardData(
                    title: "كيفيتها:",
                    content: """
        يصلي ركعتين ركعتين، ويسلم من كل ثنتين، ويوتر بواحدة.
        يوتر بواحدة، أو بثلاث، أو بخمس، أو بسبع، أو أكثر، والأمر واسع.
        وأفضلها إحدى عشرة أو ثلاث عشرة ركعة تأسيًا بالنبي ﷺ.
        """
                ),
                CardData(
                    title: "القراءة فيها:",
                    content: """
        يقرأ ما تيسر من أول القرآن أو أوسطه أو آخره، أو ينظم ختمه.
        والسنة الترتيل، ويستحب السؤال عند آية الرحمة، والتعوذ عند آية الوعيد، والتسبيح عند آية التسبيح.
        """
                ),
                CardData(
                    title: "صفتها:",
                    content: """
        السنة الطمأنينة وعدم العجلة في الركوع والسجود والقراءة، والخشوع فيها تأسيًا بالنبي ﷺ.
        """
                )
            ]
            
        case .sunnahFajr:
            return [
                CardData(
                    title: "حكمها",
                    content: """
سنة الفجر ركعتان قبل صلاة الفجر،
وهي من أكثر السنن تأكيداً ولم يكن النبي ﷺ يتركها.
"""
                ),
                CardData(
                    title: "فضلها",
                    content: """
قال النبي ﷺ: «ركعتا الفجر خير من الدنيا وما فيها».
"""
                ),
                CardData(
                    title: "وقتها",
                    content: """
تصلى بعد دخول وقت الفجر وقبل صلاة الفجر المفروضة.
"""
                )
            ]
            
        case .sunnahDhuhr:
            return [
                CardData(
                    title: "حكمها",
                    content: """
            سنة راتبة مؤكدة من الرواتب التي كان النبي ﷺ يواظب عليها.  
            وهي داخلة في قوله ﷺ:
            «من صلى ثنتي عشرة ركعة في يومه وليلته بنى الله له بيتاً في الجنة»
            """
                ),
                CardData(
                    title: "وقتها",
                    content: """
            قبل الظهر: ركعتان أو أربع ركعات.  
            بعد الظهر: ركعتان، ويجوز أربع
            """
                ),
                CardData(
                    title: "كيفيتها",
                    content: """
            ثبت عنه ﷺ: ركعتان قبل الظهر وركعتان بعدها.  
            وثبت أنه كان لا يدع أربعًا قبل الظهر
            الأفضل: أربع قبل الظهر وثنتان بعدها.  
            وإن صلى أربعًا بعدها مع الأربع قبلها فهو أفضل
            """
                ),
                CardData(
                    title: "فضلها",
                    content: """
            قال ﷺ:
            «من صلى أربعاً قبل الظهر وأربعاً بعدها حرمه الله على النار»
            وهي من الرواتب الاثنتي عشرة التي من حافظ عليها
            «بنى الله له بيتاً في الجنة»
            """
                )
            ]

        case .sunnahMaghrib:
            return [
                CardData(
                    title: "حكمها",
                    content: """
            سنة راتبة بعد صلاة المغرب ركعتان.  
            ويشرع قبلها ركعتان بعد الأذان وقبل الإقامة
            """
                ),
                CardData(
                    title: "وقتها",
                    content: """
            القبلية: بعد أذان المغرب وقبل الإقامة.  
            البعدية: بعد صلاة المغرب مباشرة
            """
                ),
                CardData(
                    title: "كيفيتها",
                    content: """
            بعد الفريضة: ركعتان راتبة ثابتة في الصحيحين.  
                
            قبل المغرب: ركعتان بعد الأذان؛ لقوله ﷺ:
            «صلوا قبل المغرب، صلوا قبل المغرب»
            ثم قال في الثالثة: «لمن شاء»
            """
                ),
                CardData(
                    title: "فضلها",
                    content: """
            ثبتت من قوله ﷺ ومن تقريره للصحابة.  
            كان الصحابة يصلون ركعتين قبل المغرب
            وهو ينظر إليهم ويقرهم، فدل ذلك على سنيتها
            """
                )
            ]

        case .sunnahIsha:
            return [
                CardData(
                    title: "حكمها",
                    content: """
            سنة راتبة بعد صلاة العشاء.  
            ويشرع قبلها ركعتان بين الأذان والإقامة
            """
                ),
                CardData(
                    title: "وقتها",
                    content: """
            القبلية: بعد أذان العشاء وقبل الإقامة.  
            البعدية: بعد صلاة العشاء مباشرة.  
            الوتر: بعد راتبة العشاء
            """
                ),
                CardData(
                    title: "كيفيتها",
                    content: """
            بعد الفريضة: ركعتان راتبة.  
            ثم يوتر بعدها:
            يصلي ركعتين ويوتر بواحدة،  
            أو يوتر بركعة واحدة فقط.  
            وإن صلى ثلاثًا أو خمسًا أو أكثر زاد أجره
            قبل العشاء: ركعتان بعد الأذان 
            وقبل الإقامة
            """
                ),
                CardData(
                    title: "فضلها",
                    content: """
            داخلة في قوله ﷺ:
            «بين كل أذانين صلاة»
                
            وفعلها يجمع بين الصلاة بين الأذانين
            وتحية المسجد لمن دخل
            """
                )
            ]

        // MARK: FASTING TOPICS
        case .mondayThursday:
            return [
                CardData(
                    title: "فضلها",
                    content: """
            ثبت عن رسول الله ﷺ
            أنه كان يصوم الإثنين والخميس ويقول:
            «إنهما يومان تُعرض فيهما الأعمال على الله،
            فأحب أن يُعرض عملي وأنا صائم»
            (رواه مسلم)

            """
                ),
                CardData(
                    title: "وقتها",
                    content: """
            تُصام كل أسبوع:
            يوم الإثنين ويوم الخميس.
            """
                ),
                CardData(
                    title: "حكمها",
                    content: """
            سنة مستحبة.
            من فعلها أُجر،
            ومن تركها فلا حرج عليه.
            """
                )
            ]

         case .whiteDays:
            return [
                CardData(
                    title: "فضلها",
                    content: """
            السنة صيام ثلاثة أيام من كل شهر.

            وإذا كانت في أيام البيض
            كان ذلك أفضل وأعظم أجرًا.
            """
                ),
                CardData(
                    title: "وقتها",
                    content: """
            أيام البيض هي:
            الثالث عشر
            والرابع عشر
            والخامس عشر
            من كل شهر هجري.
            """
                ),
                CardData(
                    title: "حكمها",
                    content: """
            سنة مستحبة.

            من صامها فله أجر،
            وإن صام ثلاثة أيام من غيرها
            أجزأه ذلك،
            لكن صيامها أفضل.
            """
                )
            ]

        case .arafah:
            return [
                CardData(
                    title: "فضله",
                    content: """
            ثبت عن النبي ﷺ أن صيام يوم عرفة يكفّر السنة التي قبلها والتي بعدها، أي يكفّر الصغائر إذا اجتنب الإنسان الكبائر.  
            وهو يوم عظيم فيه فضل كبير، وصيامه عبادة عظيمة، من أسباب مغفرة الذنوب وقرب العبد من الله تعالى.
            """
                ),
                CardData(
                    title: "حكمه",
                    content: """
            يُستحب صيامه لغير الحاج، لأن الحاج يكون مشغولًا بأعمال الحج.  
            أما الحاج فلا يُستحب له الصيام يوم عرفة.
            """
                ),
                CardData(
                    title: "الدليل",
                    content: """
            قال الله تعالى: 
            «إِنْ تَجْتَنِبُوا كَبَائِرَ مَا تُنْهَوْنَ عَنْهُ نُكَفِّرْ عَنْكُمْ سَيِّئَاتِكُمْ» [النساء:31]  
            وقد ورد عن النبي ﷺ حديث: الصلوات الخمس، والجمعة إلى الجمعة، ورمضان إلى رمضان كفارة لما بينهنّ ما لم تُغش الكبائر، وهكذا صيام عرفة يكفر صغائر السنة السابقة واللاحقة.
            """
                ),
                CardData(
                    title: "أهميته",
                    content: """
            يوم عرفة من أعظم الأيام عند الله، وفضل صيامه عظيم.  
            الصائم فيه يتحفظ عن المنكرات، ويكثر من الطاعات، ويتقرب إلى الله تعالى.  
            إنه يوم تكفير للصغائر وعظيم الأجر لمن يخلص لله صومه وعبادته.
            """
                )
            ]
            
        case .dhuHijahTen:
            return [
                CardData(
                    title: "فضلها",
                    content: """
            أيام العشر من ذي الحجة من أعظم الأيام عند الله، وورد عن النبي ﷺ قوله:  
            «ما من أيام العمل الصالح فيها خير وأحب إلى الله من هذه الأيام العشر» (رواه البخاري).  
            لذلك يُستحب الإكثار فيها من الطاعات مثل الصلاة، الصيام، الذكر، والتهليل والتكبير والتحميد.
            """
                ),
                CardData(
                    title: "حكم صيامها",
                    content: """
            صيام هذه الأيام سُنة، وليس فرضًا.  
            لم يثبت عن النبي ﷺ أنه صام كل هذه الأيام، فصومها مستحب لمن أراد الاجتهاد فيها.  
            وقد روى عن عائشة رضي الله عنها: أنها لم تعلم النبي ﷺ يصومها،  
            وعن حفصة رضي الله عنها أنه صامها لكن في سند الرواية بعض الاضطراب.
            """
                ),
                CardData(
                    title: "الأعمال فيها",
                    content: """
            يُستحب الإكثار في هذه الأيام من:  
            - الصيام لمن استطاع  
            - الصلاة وقيام الليل  
            - الذكر، التهليل، التكبير والتحميد  
            فهي أيام مباركة يحب الله العمل الصالح فيها ويضاعف الأجر.
            """
                )
            ]


        case .ashura:
            return [
                CardData(
                    title: "حكمه",
                    content: """
صيام يوم عاشوراء سنة مؤكدة.
ويُستحب صيام يوم قبله أو بعده.
"""
                ),
                CardData(
                    title: "فضله",
                    content: """
قال النبي ﷺ: «صيام يوم عاشوراء أحتسب على الله
أن يكفر السنة التي قبله».
"""
                ),
                CardData(
                    title: "وقته",
                    content: """
يوم عاشوراء هو اليوم العاشر من شهر محرم.
والأفضل صيامه مع التاسع أو الحادي عشر.
"""
                )
            ]
            
        case .shawwal:
            return [
                CardData(
                    title: "فضله",
                    content: """
            قال رسول الله ﷺ:
            «من صام رمضان ثم أتبعه ستاً من شوال كان كصيام الدهر»
            (رواه مسلم)

            من صامها بعد رمضان
            كان كصيام الدهر.
            وهي نافلة وليست فريضة.
            """
                ),
                CardData(
                    title:"وقته",
                    content: """
            تُصام في شهر شوال كله.
            ليس لها أيام محددة.
            """
                ),
                CardData(
                    title: "كيفيته",
                    content: """
            يجوز صيامها في أول الشهر أو وسطه أو آخره.
            ويجوز أن تكون متتابعة أو متفرقة.
            والأمر فيها واسع.

            والأفضل المبادرة بها
            من باب المسارعة إلى الخير.
            """
                )
            ]

                        
        // MARK: Adkhar topics

        case .morningAdhkar:
            return [

                CardData(
                    title: "آية الكرسي",
                    content: """
        ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ ٢٥٥

        «البقرة»
        """
                ),

                CardData(
                    title: "سورة الإخلاص",
                    content: """
        بسم الله الرحمن الرحيم

        قُلۡ هُوَ ٱللَّهُ أَحَدٌ ١ ٱللَّهُ ٱلصَّمَدُ ٢ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ٣ وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ٤
        «الإخلاص»
        ثلاث مرات
        """
                ),

                CardData(
                    title: "سورة الفلق",
                    content: """
        بسم الله الرحمن الرحيم

        قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ١ مِن شَرِّ مَا خَلَقَ ٢ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ٣ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ ٤ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ٥
        «الفلق»
        ثلاث مرات
        """
                ),

                CardData(
                    title: "سورة الناس",
                    content: """
        بسم الله الرحمن الرحيم

        قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ١ مَلِكِ ٱلنَّاسِ ٢ إِلَٰهِ ٱلنَّاسِ ٣ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ٤ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ٥ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ٦
        «الناس»
        ثلاث مرات
        """
                ),

                CardData(
                    title: " ",
                    content: """
        أَصْبَحْنَا وَأَصْبَح الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ، وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذا اليوم وَخَيْرَ مَا بَعْدَهَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذا اليوم وَشَرِّ مَا بَعْدَه، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ.

        (رواه مسلم)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ بِكَ أصْبَحْنَا، وبِكَ أمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وإلَيْكَ النُّشُورُ.

        (رواه الترمذي)
        """
                ),

                CardData(
                    title: "سيد الاستغفار",
                    content: """
        اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلاَّ أَنْتَ، خَلَقْتَنِي وأنَا عَبْدُكَ، وأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وأبُوْءُ بِذَنْبِي فَاغْفِر لِي فَإنَّه لا يَغْفِرُ الذُّنُوبَ إلاَّ أَنْتَ.

        من قالها موقنًا بها حين يمسي فمات من يومه دخل الجنة. (رواه البخاري)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ إنِّي أصْبَحْتُ أُشْهِدُكَ، وأُشْهِدُ حَمَلَةَ عَرْشِكَ، ومَلائِكَتَكَ، وجَميْعَ خَلْقِكَ، أنَّكَ أنْتَ اللهُ لا إلَهَ إلاَّ أنْتَ وَحْدَكَ لا شَرِيْكَ لَكَ، وأنَّ مُحَمَّدًا عَبْدُكَ ورَسُولُكَ.

        من قالها حين يصبح أو يمسي أربع مرات أعتقه الله من النار. (رواه أبو داود)
        أربع مرات
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ مَا أصْبَحَ بِي مِنْ نِعْمَةٍ، أوْ بِأحَدٍ مِنْ خَلقِكَ، فَمِنْكَ وَحْدَكَ لا شَرِيْكَ لَكَ، فَلَكَ الحَمْدُ ولَكَ الشُّكْرُ.

        من قالها حين يصبح فقد أدى شكر يومه ومن قالها حين يمسي فقد أدى شكر ليلته. (رواه أبوداود)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.

        ثلاث مرات
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ.

        (رواه أبوداود)
        """
                )

            ]

            
        case .eveningAdhkar:
            return [

                CardData(
                    title: "آية الكرسي",
                    content: """
        ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَـُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ ٢٥٥

        «البقرة»
        """
                ),

                CardData(
                    title: "سورة الإخلاص",
                    content: """
        بسم الله الرحمن الرحيم

        قُلۡ هُوَ ٱللَّهُ أَحَدٌ ١ ٱللَّهُ ٱلصَّمَدُ ٢ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ ٣ وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ ٤
        «الإخلاص»
        ثلاث مرات
        """
                ),

                CardData(
                    title: "سورة الفلق",
                    content: """
        بسم الله الرحمن الرحيم

        قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ ١ مِن شَرِّ مَا خَلَقَ ٢ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ٣ وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ ٤ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ٥
        «الفلق»
        ثلاث مرات
        """
                ),

                CardData(
                    title: "سورة الناس",
                    content: """
        بسم الله الرحمن الرحيم

        قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ ١ مَلِكِ ٱلنَّاسِ ٢ إِلَٰهِ ٱلنَّاسِ ٣ مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ٤ ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ٥ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ٦
        «الناس»
        ثلاث مرات
        """
                ),

                CardData(
                    title: " ",
                    content: """
        أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ، وَوَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ. (رواه مسلم)
        """
                ),

                CardData(
                    title: "سيد الاستغفار",
                    content: """
        اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلاَّ أَنْتَ، خَلَقْتَنِي وأنَا عَبْدُكَ، وأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وأبُوْءُ بِذَنْبِي فَاغْفِر لِي فَإنَّه لا يَغْفِرُ الذُّنُوبَ إلاَّ أَنْتَ.

        من قالها موقنًا بها حين يمسي فمات من ليلته دخل الجنة. (رواه البخاري)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ إنِّي أمسيت أُشْهِدُكَ، وأُشْهِدُ حَمَلَةَ عَرْشِكَ، ومَلائِكَتَكَ، وجَميع خَلْقِكَ، أنَّكَ أنْتَ اللهُ لا إلَهَ إلاَّ أنْتَ وَحْدَكَ لا شَرِيكَ لَكَ، وأنَّ مُحَمَّدًا عَبْدُكَ ورَسُولُكَ.

        من قالها حين يمسي أو يصبح أربع مرات أعتقه الله من النار. (رواه أبو داود)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ مَا أمْسَى بِي مِنْ نِعْمَةٍ، أوْ بِأحَدٍ مِنْ خَلقِكَ، فَمِنْكَ وَحْدَكَ لا شَرِيكَ لَكَ، فَلَكَ الحَمْدُ وَلَكَ الشُّكْرُ.

        من قالها حين يمسي فقد أدى شكر ليلته. (رواه أبوداود)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ. (رواه أحمد) ثلاث مرات
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ. (رواه أبوداود)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        حَسْبِيَ اللهُ لاَ إلَهَ إلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ العَرْشِ العَظِيمِ.

        من قالها سبع مرات حين يمسي وحين يصبح كفاه الله ما أهمه من أمر الدنيا والآخرة. (رواه ابن السني)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ إنِّي أسْألُكَ العَفْوَ والعَافيةَ في الدُّنْيا والآخِرة، اللَّهُمَّ إنِّي أسْألُكَ العَفْوَ والعَافيةَ في دِيْني ودُنْيَاي وأهْلي ومَالي، اللَّهُمَّ استُر عَوْرَاتي، وآمِن رَوْعَاتي، اللَّهُمَّ احْفَظْني مِنْ بَيْنِ يَدَيَّ، ومِنْ خَلْفِي، وعَنْ يَميني، وعَنْ شِمَالي، ومِنْ فَوْقِي، وأعُوذُ بِعَظَمَتكَ أنْ أُغْتالَ مِنْ تَحْتي. (رواه أبوداود)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ عَالِمَ الغَيْبِ والشَّهَادَةِ، فَاطِرَ السَّموَاتِ والأرْضِ، رَبَّ كُلِّ شَيءٍ ومَلِكَهُ، أشْهَدُ أنْ لا إلَهَ إلاَّ أَنْتَ، أعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكهِ، وأنْ أقْتَرِفَ عَلَى نَفْسِي سُوءًا، أوْ أجُرَّهُ إلَى مُسْلِمٍ. (رواه الترمذي)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        بِسْمِ اللَّهِ الَّذِي لا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ، فِي الْأَرْضِ، وَلَا فِي السَّمَاءِ، وَهُوَ السَّمِيعُ الْعَلِيمُ.

        من قالها ثلاث مرات إذا أصبح وثلاث مرات إذا أمسى لم يضره شيء. (رواه ابن ماجه)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        رَضِيتُ بِاللهِ رَبًّا، وَبِالإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ ﷺ نَبِيًّا.

        من قالها ثلاث مرات حين يمسي وثلاث مرات حين يصبح كان حقًا على الله أن يرضيه يوم القيامة. (رواه أحمد)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ، أصلِحْ لي شَأْني كُلَّهُ، ولا تَكِلْني إلَى نَفسي طَرْفَةَ عَيْنٍ. (رواه الترمذي)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        أمْسَيْنَا وأمْسَى الْمُلْكُ للَّهِ رَبِّ العَالَمينَ، اللَّهُمَّ إنِّي أسْألُكَ خَيْرَ هَذِهِ اللَّيْلَةِ، فَتْحَهَا ونَصْرَهَا ونُوْرَهَا وبَرَكَتهَا وَهُدَاهَا، وأعوذُ بِكَ مِنْ شَرِّ مَا فيها وَشَرِّ مَا بَعْدَهَا. (رواه أبو داود)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        أمْسَيْنَا عَلَى فِطْرَةِ الإسْلامِ، وعَلَى كَلِمَةِ الإخْلاصِ، وعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وعَلَى مِلَّةِ أبِينَا إبْرَاهيمَ، حَنيفًا مُسْلِمًا ومَا كَانَ مِنَ المُشْرِكِينَ. (رواه أحمد)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        لاَ إِلَهَ إِلَّا اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.

        يقولها عشر مرات. (رواه أبو داود)

        من قالها مائة مرة في يوم كانت له عدل عشر رقاب وكتبت له مائة حسنة ومحيت عنه مائة سيئة وكانت له حرزًا من الشيطان يومه ذلك حتى يمسي. (رواه الترمذي)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        سُبْحَانَ الله وَبِحَمْدِهِ.

        من قالها مائة مرة حين يمسي وحين يصبح لم يأت أحد يوم القيامة بأفضل مما جاء به إلا من زاد عليه. (رواه مسلم)
        """
                ),

                CardData(
                    title: " ",
                    content: """
        أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.

        من قالها حين يمسي ثلاث مرات لا تضره حُمَة هذه الليلة.
        """
                ),

                CardData(
                    title: " ",
                    content: """
        اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ ﷺ.

        من صلى عليه صلاة واحدة صلى الله عليه بها عشرًا.
        """
                )

            ]

        }
        
    }
}

